; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-3-2-2-5-5-7) (:domain depots)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 depot1)
	(clear crate6)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate4)
	(at truck0 distributor1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor1)
	(on crate3 pallet4)
	(at crate4 distributor1)
	(on crate4 crate3)
	(at crate5 depot0)
	(on crate5 crate1)
	(at crate6 depot1)
	(on crate6 crate2)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate4 pallet3)
		(on crate5 crate4)
		(on crate6 pallet1)
	)
))

; plan
1. (lift hoist1 crate6 crate2 depot1)
   deleted: (at crate6 depot1) (available hoist1) (on crate6 crate2) (clear crate6)
   added: (lifting hoist1 crate6) (clear crate2)
   goals met: 0 of 6
2. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 0 of 6
3. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 6
4. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 0 of 6
5. (unload hoist1 crate6 truck1 depot1)
   deleted: (available hoist1) (in crate6 truck1)
   added: (lifting hoist1 crate6)
   goals met: 0 of 6
6. (lift hoist4 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (available hoist4) (on crate4 crate3) (clear crate4)
   added: (lifting hoist4 crate4) (clear crate3)
   goals met: 0 of 6
7. (load hoist4 crate4 truck0 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 0 of 6
8. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (available hoist0) (on crate5 crate1) (clear crate5)
   added: (lifting hoist0 crate5) (clear crate1)
   goals met: 0 of 6
9. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 0 of 6
10. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   goals met: 0 of 6
11. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 crate0) (clear crate1)
   added: (lifting hoist0 crate1) (clear crate0)
   goals met: 0 of 6
12. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 6
13. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 6
14. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 0 of 6
15. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 0 of 6
16. (unload hoist0 crate2 truck1 depot0)
   deleted: (available hoist0) (in crate2 truck1)
   added: (lifting hoist0 crate2)
   goals met: 0 of 6
17. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (at crate2 depot0) (available hoist0) (on crate2 pallet0) (clear crate2)
   goals met: 1 of 6
18. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 1 of 6
19. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 6
20. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (at crate6 depot1) (available hoist1) (on crate6 pallet1) (clear crate6)
   goals met: 2 of 6
21. (unload hoist2 crate1 truck1 depot2)
   deleted: (available hoist2) (in crate1 truck1)
   added: (lifting hoist2 crate1)
   goals met: 2 of 6
22. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   goals met: 3 of 6
23. (unload hoist2 crate0 truck1 depot2)
   deleted: (available hoist2) (in crate0 truck1)
   added: (lifting hoist2 crate0)
   goals met: 3 of 6
24. (drop hoist2 crate0 crate1 depot2)
   deleted: (lifting hoist2 crate0) (clear crate1)
   added: (at crate0 depot2) (available hoist2) (on crate0 crate1) (clear crate0)
   goals met: 4 of 6
25. (unload hoist3 crate4 truck0 distributor0)
   deleted: (available hoist3) (in crate4 truck0)
   added: (lifting hoist3 crate4)
   goals met: 4 of 6
26. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (at crate4 distributor0) (available hoist3) (on crate4 pallet3) (clear crate4)
   goals met: 5 of 6
27. (unload hoist3 crate5 truck0 distributor0)
   deleted: (available hoist3) (in crate5 truck0)
   added: (lifting hoist3 crate5)
   goals met: 5 of 6
28. (drop hoist3 crate5 crate4 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate4)
   added: (at crate5 distributor0) (available hoist3) (on crate5 crate4) (clear crate5)
   goals met: 6 of 6
